PaymentCreateAllISPC/results/20211007/BMPaymentV16/PAYCTFORDOMOUPSME_PaymentRead20211007151613719.txt

Status: PASS
Time Taken: 935
Size: 5687
Timestamp: Thu Oct 07 15:16:12 IST 2021
TestStep: PaymentRead

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Endpoint: http://10.246.89.109:20811/pin/services/PINSPayment_V2_0
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: SOAPAction : ""
Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.5.2 (Java/16.0.1)
Host : 10.246.89.109:20811
Accept-Encoding : gzip,deflate
Content-Length : 2003
Content-Type : text/xml;charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://edb.com/ws/WSCommon_v22" xmlns:urn="urn:pins.payment.evry.com:ws:paymentinitiation:v2_0">
   <soapenv:Header>
      <wsc:AutHeader>
         <wsc:SourceApplication>PaymentClient</wsc:SourceApplication>
         <wsc:DestinationApplication>PIN</wsc:DestinationApplication>
         <wsc:Function>paymentAuthorizationCreate</wsc:Function>
         <wsc:Version>1.0</wsc:Version>
         <wsc:ClientContext>
            <wsc:userid>55057203187</wsc:userid>
            <wsc:credentials>03111012010400425kbKcJMZoMF56OVtVL1neI9CfuAtjCBO603eS0IgWm1WWIO7EfpSL4DE/lDFi69n1sSaabKNt2t+xJppso23a37EmmmyjbdrfF3M0FKxtlD/HJbEkbc46/BMCstNp869esSaabKNt2t/XzlyjxYnxhcG46wcbIKp/sSaabKNt2t9wBUG0SyIoqFfig80Gq4uXVBtimDzTiu3EfQIWD5xMfslE2lt0gldZQIyIMvAwCMo=Owe13MJu4QRF5Vj5fdm42aK3nL6InZ7iUXQ2d3QvsDlp4SRrFo03WNE0BwBvlyk3Y5tHWP+DVGwZTtsKKiL4yr1VcsAzMmjub6dAdZ8J2NSTeOl14BcfV4hHDqgvdtQ6wTLSNlDSmdoQHUgDHgLgF/oRUnWDutHal9uw/ZEemPI=</wsc:credentials>
            <wsc:channel>BES</wsc:channel>
            <wsc:orgid>2544</wsc:orgid>
            <!--Optional:-->
            <wsc:orgunit>2544</wsc:orgunit>
            <!--Optional:-->
            <wsc:customerid>55057203187</wsc:customerid>
            <!--Optional:-->
            <wsc:locale>en</wsc:locale>
            <wsc:ip>1.1.1.1</wsc:ip>
            <!--Zero or more repetitions:-->
            <wsc:item key="TppId" value="1"/>
            <wsc:item key="TppName" value="ABC"/>
            <wsc:item key="PaymentChannel" value="BES"/>
            <wsc:item key="LogRef" value="2544bank"/>
            <wsc:item key="AgreementId" value="55057203187"/>
         </wsc:ClientContext>
      </wsc:AutHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:PaymentReadRequest>
         <!--You have a CHOICE of the next 2 items at this level-->
         <urn:transactionId>260896925</urn:transactionId>
      </urn:PaymentReadRequest>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
Response Headers: Transfer-Encoding : chunked
Server : Jetty(9.4.34.v20201102)
X-sorp : 55057203187;2544;55057203187;PaymentClient;PIN;PINSPayment_V2_0.PaymentRead;-;2544bank;0;0;false
#status# : HTTP/1.1 200 OK
Content-Type : text/xml;charset=utf-8


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:PaymentReadResponse xmlns:ns10="urn:pins.payment.evry.com:ws:paymentutil:v2_0" xmlns:ns9="urn:pins.payment.evry.com:domain:paymentutil:v2_0" xmlns:ns8="urn:pins.payment.evry.com:domain:nationalinformation-nor:v2_0" xmlns:ns7="urn:pins.payment.evry.com:domain:creditor:v2_0" xmlns:ns6="urn:pins.payment.evry.com:domain:debtor:v2_0" xmlns:ns5="urn:pins.payment.evry.com:domain:complex-types:v2_0" xmlns:ns4="urn:pins.payment.evry.com:domain:paymentinitiation:v2_0" xmlns:ns3="urn:pins.payment.evry.com:domain:common:v2_0" xmlns:ns2="urn:pins.payment.evry.com:ws:paymentinitiation:v2_0" xmlns="http://edb.com/ws/WSCommon_v22">
         <ns3:ResponseState>
            <ErrorCode>0</ErrorCode>
            <Severity>0</Severity>
            <ComponentId>111</ComponentId>
            <Message>OK</Message>
            <LogSequence xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
         </ns3:ResponseState>
         <ns2:paymentResult>
            <ns4:result>
               <ns4:paymentReference>260896925</ns4:paymentReference>
               <ns4:transactionId>260896925</ns4:transactionId>
               <ns4:messageId>1025510</ns4:messageId>
               <ns4:paymentInfoId>1118959</ns4:paymentInfoId>
               <ns4:initiatorIdentifier>55057203187</ns4:initiatorIdentifier>
               <ns4:paymentStatus>READY_FOR_DUE_DATE</ns4:paymentStatus>
               <ns4:prioritized>false</ns4:prioritized>
               <ns4:originalFormat>CLIENT_GENERATED</ns4:originalFormat>
               <ns4:releaseDate>2021-10-07+02:00</ns4:releaseDate>
               <ns4:internalProductCode>PAYCTFORDOMOUPSME</ns4:internalProductCode>
               <ns4:paymentProduct>PI Domestic</ns4:paymentProduct>
               <ns4:transactionFee currency="NOK">
                  <ns5:amount>5.00</ns5:amount>
               </ns4:transactionFee>
               <ns4:additionalServiceCharge>
                  <ns5:serviceName>PI Foreign Account</ns5:serviceName>
                  <ns5:charge currency="NOK">
                     <ns5:amount>3.00</ns5:amount>
                  </ns5:charge>
               </ns4:additionalServiceCharge>
               <ns4:paymentIdentification>
                  <ns5:messageIdentification>1302824</ns5:messageIdentification>
                  <ns5:endToEndIdentification>PAYCTFORDOMOUPSME</ns5:endToEndIdentification>
               </ns4:paymentIdentification>
               <ns4:groupHeader>
                  <ns5:creationDateTime>2021-10-07T11:46:09.000+02:00</ns5:creationDateTime>
               </ns4:groupHeader>
               <ns4:paymentInfo>
                  <ns6:paymentMethod>TRF</ns6:paymentMethod>
                  <ns6:paymentTypeInformation>
                     <ns6:instructionPriority>NORM</ns6:instructionPriority>
                     <ns6:categoryPurpose>SUPP</ns6:categoryPurpose>
                  </ns6:paymentTypeInformation>
                  <ns6:requestedExecutionDate>2021-10-07+02:00</ns6:requestedExecutionDate>
                  <ns6:debtorAccount>
                     <ns5:identification>36281079039</ns5:identification>
                     <ns5:currency>NOK</ns5:currency>
                  </ns6:debtorAccount>
                  <ns6:debtorAgentBIC>SPAVNOBBXXX</ns6:debtorAgentBIC>
                  <ns6:debtor>
                     <ns5:name>debt</ns5:name>
                     <ns5:postalAddress>
                        <ns5:addressType>ADDR</ns5:addressType>
                        <ns5:department>adfa</ns5:department>
                        <ns5:subDepartment>adfa</ns5:subDepartment>
                        <ns5:streetName>stret</ns5:streetName>
                        <ns5:buildingNumber>123</ns5:buildingNumber>
                        <ns5:postCode>7919</ns5:postCode>
                        <ns5:townName>teewne</ns5:townName>
                        <ns5:country>NO</ns5:country>
                     </ns5:postalAddress>
                  </ns6:debtor>
               </ns4:paymentInfo>
               <ns4:transaction>
                  <ns7:amount>
                     <ns5:instructedAmount currency="NOK">
                        <ns5:amount>1.00</ns5:amount>
                     </ns5:instructedAmount>
                  </ns7:amount>
                  <ns7:chargeBearer>SHAR</ns7:chargeBearer>
                  <ns7:creditorAgent>
                     <ns5:bic>VEFONO21XXX</ns5:bic>
                     <ns5:nationalId>2544</ns5:nationalId>
                     <ns5:postalAddress>
                        <ns5:addressType>ADDR</ns5:addressType>
                        <ns5:postCode>1122</ns5:postCode>
                        <ns5:country>NO</ns5:country>
                     </ns5:postalAddress>
                  </ns7:creditorAgent>
                  <ns7:creditor>
                     <ns5:name>After name</ns5:name>
                     <ns5:postalAddress>
                        <ns5:addressType>PBOX</ns5:addressType>
                        <ns5:buildingNumber>jjj</ns5:buildingNumber>
                        <ns5:postCode>11</ns5:postCode>
                        <ns5:country>NO</ns5:country>
                     </ns5:postalAddress>
                  </ns7:creditor>
                  <ns7:creditorAccount>
                     <ns5:identification>24801016517</ns5:identification>
                     <ns5:currency>NOK</ns5:currency>
                  </ns7:creditorAccount>
                  <ns7:confidential>false</ns7:confidential>
                  <ns7:uetrId>c931bedd-40f4-4fae-ae80-cfae621510ae</ns7:uetrId>
                  <ns4:remittanceInformation>
                     <ns5:remittanceInformationStructured>
                        <ns5:referredDocumentInformation>
                           <ns5:type>CINV</ns5:type>
                           <ns5:issuer>check CINV</ns5:issuer>
                           <ns5:relatedDate>2021-10-08+02:00</ns5:relatedDate>
                           <ns5:invoiceeOtherId>2910</ns5:invoiceeOtherId>
                        </ns5:referredDocumentInformation>
                     </ns5:remittanceInformationStructured>
                  </ns4:remittanceInformation>
                  <ns4:nationalSpecificPaymentInformation xsi:type="ns8:NorwegianNationalPaymentInformation" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                     <ns8:receiptOrder>NONE</ns8:receiptOrder>
                  </ns4:nationalSpecificPaymentInformation>
               </ns4:transaction>
               <ns4:approver>
                  <ns5:userid>55057203187</ns5:userid>
                  <ns5:name>Fname Lname</ns5:name>
                  <ns5:dateOfApproval>2021-10-07T11:46:11.489+02:00</ns5:dateOfApproval>
               </ns4:approver>
               <ns4:marketType>BM</ns4:marketType>
               <ns4:originalChannel>BES</ns4:originalChannel>
               <ns4:paymentAdditionalInfo>
                  <ns5:debitValueDate>DAY0</ns5:debitValueDate>
                  <ns5:creditValueDate>SPOT</ns5:creditValueDate>
               </ns4:paymentAdditionalInfo>
            </ns4:result>
            <ns4:paymentAmounts>
               <ns5:debitAmount currency="NOK">
                  <ns5:amount>1.00</ns5:amount>
               </ns5:debitAmount>
               <ns5:creditAmount currency="NOK">
                  <ns5:amount>1.00</ns5:amount>
               </ns5:creditAmount>
               <ns5:debitCounterValue currency="NOK">
                  <ns5:amount>1.00</ns5:amount>
               </ns5:debitCounterValue>
               <ns5:creditCounterValue currency="NOK">
                  <ns5:amount>1.00</ns5:amount>
               </ns5:creditCounterValue>
               <ns5:conversionRateInfo>
                  <ns5:rate>1</ns5:rate>
                  <ns5:type>NONE</ns5:type>
                  <ns5:unitNumber>1</ns5:unitNumber>
               </ns5:conversionRateInfo>
            </ns4:paymentAmounts>
            <ns4:operationsArray>UNAPPROVE_PAYMENT</ns4:operationsArray>
            <ns4:operationsArray>VIEW_PAYMENT</ns4:operationsArray>
            <ns4:operationsArray>STOP_PAYMENT</ns4:operationsArray>
            <ns4:operationsArray>PRIORITIZE_PAYMENT</ns4:operationsArray>
         </ns2:paymentResult>
      </ns2:PaymentReadResponse>
   </soap:Body>
</soap:Envelope>
